In [2]:
# import libraries

%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

# Coding begins for loading and creating subsets from the data

In [3]:
# import data
housing_df = pd.read_csv('Westroxbury.csv')
housing_df.head()

,TOTAL VALUE,TAX,LOT SQFT,YR BUILT,GROSS AREA,LIVING AREA,FLOORS,ROOMS,BEDROOMS,FULL BATH,HALF BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2,0,1,0,None

In [4]:
# rename all columns
housing_df.columns =[s.strip().replace(' ', '_') for s in housing_df.columns]

In [5]:
# showing the first four rows of the data

housing_df.loc[0:3] #loc[a:b] gives rows a to b inclusive

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None

In [6]:
housing_df.iloc[0:4] #iloc[a:b] gives rows a to b-1

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
0,344.2,4330,9965,1880,2436,1352,2.0,6,3,1,1,1,0,None
1,412.6,5190,6590,1945,3108,1976,2.0,10,4,2,1,1,0,Recent
2,330.1,4152,7500,1890,2294,1371,2.0,8,4,1,1,1,0,None
3,498.6,6272,13773,1957,5032,2608,1.0,9,5,1,1,1,1,None

In [7]:
# Differen tway of showing the first 10 values in total_Value

housing_df['TOTAL_VALUE'].iloc[0:10]

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [8]:
housing_df.iloc[0:10]['TOTAL_VALUE']

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [9]:
housing_df.iloc[0:10].TOTAL_VALUE # use dot notation only if the column name has no spaces

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [10]:
# show the fifth row of the first 10 columns
housing_df.iloc[4][0:10]

TOTAL_VALUE    331.5
TAX             4170
LOT_SQFT        5000
YR_BUILT        1910
GROSS_AREA      2370
LIVING_AREA     1438
FLOORS           2.0
ROOMS              7
BEDROOMS           3
FULL_BATH          2
Name: 4, dtype: object

In [11]:
housing_df.iloc[4, 0:10]

TOTAL_VALUE    331.5
TAX             4170
LOT_SQFT        5000
YR_BUILT        1910
GROSS_AREA      2370
LIVING_AREA     1438
FLOORS           2.0
ROOMS              7
BEDROOMS           3
FULL_BATH          2
Name: 4, dtype: object

In [12]:
housing_df.iloc[4:6, 0:10] # use a slice to return a data frame

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH
4,331.5,4170,5000,1910,2370,1438,2.0,7,3,2
5,337.4,4244,5142,1950,2124,1060,1.0,6,3,1

In [13]:
#Use pd.concat to combine non-consecutive columns into a new data frame
# The axis argumnet spcfices the dimension along wich the concatenation happens, 0 =rows, 1=columns

pd.concat([housing_df.iloc[4:6,0:2], housing_df.iloc[4:6,4:6]], axis = 1)

   TOTAL_VALUE   TAX  GROSS_AREA  LIVING_AREA
4        331.5  4170        2370         1438
5        337.4  4244        2124         1060

In [14]:
## To specify full column use 
housing_df.iloc[:,0:1]
housing_df.TOTAL_VALUE

0       344.2
1       412.6
2       330.1
3       498.6
4       331.5
        ...
5797    404.8
5798    407.9
5799    406.5
5800    308.7
5801    447.6
Name: TOTAL_VALUE, Length: 5802, dtype: float64

In [15]:
housing_df['TOTAL_VALUE'][0:10] # show the first 10 rows of the first column

0    344.2
1    412.6
2    330.1
3    498.6
4    331.5
5    337.4
6    359.4
7    320.4
8    333.5
9    409.4
Name: TOTAL_VALUE, dtype: float64

In [16]:
# Descriptive statistics
print('Number of rows', len(housing_df['TOTAL_VALUE'])) # show length of the total value column
print('Mean of Total value', housing_df['TOTAL_VALUE'].mean()) # show mean of column
housing_df.describe()

Number of rows 5802
Mean of Total value 392.6857149258877

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE
count,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.000000,5802.00000,5802.000000
mean,392.685715,4939.485867,6278.083764,1936.744916,2924.842123,1657.065322,1.683730,6.994829,3.230093,1.296794,0.613926,1.01534,0.739917
std,99.177414,1247.649118,2669.707974,35.989910,883.984726,540.456726,0.444884,1.437657,0.846607,0.522040,0.533839,0.12291,0.565108
min,105.000000,1320.000000,997.000000,0.000000,821.000000,504.000000,1.000000,3.000000,1.000000,1.000000,0.000000,1.00000,0.000000
25%,325.125000,4089.500000,4772.000000,1920.000000,2347.000000,1308.000000,1.000000,6.000000,3.000000,1.000000,0.000000,1.00000,0.000000
50%,375.900000,4728.000000,5683.000000,1935.000000,2700.000000,1548.500000,2.000000,7.000000,3.000000,1.000000,1.000000,1.00000,1.000000
75%,438.775000,5519.500000,7022.250000,1955.000000,3239.000000,1873.750000,2.000000,8.000000,4.000000,2.000000,1.000000,1.00000,1.000000
max,1217.800000,15319.000000,46411.000000,2011.000000,8154.000000,5289.000000,3.000000,14.000000,9.000000,5.000000,3.000000,2.00000,4.000000

# Imports required functionality for this chapter

In [17]:
# importing required functionality for
from sklearn.model_selection import train_test_split
from sklearn.metrics import r2_score
from sklearn.linear_model import LinearRegression

In [18]:
# random sample of 5 observation
housing_df.sample(5)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
3716,321.4,4043,4000,1927,2193,1281,2.0,7,3,1,0,1,1,None
1769,326.5,4107,5000,1950,2256,1265,1.5,6,4,2,0,1,1,Recent
4991,414.7,5216,6245,1920,3228,1950,2.0,7,3,1,0,1,1,None
427,340.1,4278,5712,1940,3336,2036,2.0,7,3,1,1,1,1,None
2584,359.7,4525,5500,1931,2272,1300,2.0,6,3,1,0,1,1,None

# Code for sampling and over/under-sampling

In [19]:
#oversample houses wit over 10 rooms 
weights = [0.9 if rooms > 10 else 0.01 for rooms in housing_df.ROOMS]
housing_df.sample(5, weights = weights)

,TOTAL_VALUE,TAX,LOT_SQFT,YR_BUILT,GROSS_AREA,LIVING_AREA,FLOORS,ROOMS,BEDROOMS,FULL_BATH,HALF_BATH,KITCHEN,FIREPLACE,REMODEL
5124,388.5,4887,6367,1950,2823,1649,2.0,6,4,1,1,1,1,None
3318,775.5,9755,13750,1900,6633,3906,2.0,12,7,1,2,1,0,Recent
5675,478.6,6020,6500,1957,3748,2280,2.0,12,5,2,1,1,1,Recent
2463,552.9,6955,5500,1910,4842,2504,2.0,11,5,2,1,1,1,None
2274,471.5,5931,8512,1920,2534,1560,2.0,7,4,1,0,1,1,None

# Code for reviewing variables

In [20]:
housing_df.columns # print the list of variables

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

In [21]:
# Remodel needs to converted to categorical variable

housing_df.REMODEL = housing_df.REMODEL.astype('category')

In [22]:
# Show number of categories

housing_df.REMODEL.cat.categories # show number of categories

Index(['None', 'Old', 'Recent'], dtype='object')

In [23]:
# Check type of converted variable

housing_df.REMODEL.dtype

CategoricalDtype(categories=['None', 'Old', 'Recent'], ordered=False)

In [24]:
housing_df.columns

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL'],
      dtype='object')

# Code for creating binary dummies (indicators)

In [25]:
# use drop_first = True to drop the first dummy variable
housing_df = pd.get_dummies(housing_df, prefix_sep = '_', drop_first = True)
housing_df.columns

Index(['TOTAL_VALUE', 'TAX', 'LOT_SQFT', 'YR_BUILT', 'GROSS_AREA',
       'LIVING_AREA', 'FLOORS', 'ROOMS', 'BEDROOMS', 'FULL_BATH', 'HALF_BATH',
       'KITCHEN', 'FIREPLACE', 'REMODEL_Old', 'REMODEL_Recent'],
      dtype='object')

In [26]:
housing_df.loc[:, 'REMODEL_Old':'REMODEL_Recent']

      REMODEL_Old  REMODEL_Recent
0               0               0
1               0               1
2               0               0
3               0               0
4               0               0
...           ...             ...
5797            0               1
5798            0               0
5799            0               0
5800            0               0
5801            0               0

[5802 rows x 2 columns]

In [27]:
housing_df.head()
housing_df.shape

(5802, 15)

# Code for imputing missing data with median

In [1]:
# To illustrate missing data procedure, we first convert a few entries for the bedrooms to NA's.
#Then we impute these missing values using the median of the reminaing values

missingRows = housing_df.sample(10).index
housing_df.loc[missingRows, 'BEDROOMS'] = np.nan
print('Number of rows with valid bedrooms values after setting to nan:', housing_df['BEDROOMS'].count())


#Remove rows with missing values
reduced_df = housing_df.dropna()
print('Number of rows after removing rows with missing values: ', len(reduced_df))

# Replace the missing values using the median of the remaining values
medianBedrooms = housing_df["BEDROOMS"].median()
housing_df.BEDROOMS - housing_df.BEDROOMS.fillna(value=medianBedrooms)
print('Number of rows with valid BEDROOMS values after filling NA values: ', housing_df['BEDROOMS'].count())

NameError: name 'housing_df' is not defined

# Normalizing (Standardizing) and Rescaling Data - Z-score method 

# = (df-df.mean())/df.std()

# Code for normalizing and rescalling a data frame

In [2]:

from sklearn.preprocessing import MinMaxScaler, StandardScaler
df = housing_df.copy()

# normalizing a data frame

# With pandas: 

norm1_df = (housing_df-housing_df.mean())/housing_df.std()

# the results of the transformation is a numpy array, we convert it into a dataframe
# Rescaling a data froma

norm1_df = (housing_df - housing_df.min())/ (housing_df.max() - housing_df.min())


# ******************************** #


# with Scikit- Learn:

scaler = StandardScaler()
norm_df = pd.DataFrame(scaler.fit_transform(housing_df), index = housing_df.index, columns= housing_df.columns)


#scikit-learn:

scaler = MinMaxScaler()
norm_df = pd.DataFrame(scaler.fit_transform(housing_df), index=housing_df.index, columns=housing_df.columns)

NameError: name 'housing_df' is not defined

In [ ]:
norm_df.head()

# Predictive power and Overfitting

# Builds Models(Training data) --- > Evaluate Models (Validate Data) ---> Re-evaliate models(optional) (Test data) ----> Predict/classify using final model (Ne Data)

## Code for partitioning the west roxbury data into training, validation (and test) sets

In [ ]:
# random_state is set to a defined value to get the same partition when re-running the code
#training - 60

trainData, validData = train_test_split(housing_df, test_size = 0.40, random_state = 1)
print('Training : ', trainData.shape)
print('Validation : ', validData.shape)
print()

# training 50

trainData, temp = train_test_split(housing_df, test_size = 0.50, random_state =1)
validaData, testData = train_test_split(temp, test_size = 0.4, random_state =1)
print('Training: ', trainData.shape)
print('Validation: ', validData.shape)
print('Test : ', testData.shape)

# Code for fitting a regression model to training data

In [32]:
## We are re-writting some of the code such as read, repalcing space with _, creating dummies etc

from sklearn.linear_model import LinearRegression

#data loading and preprocessing

housing_df = pd.read_csv('Westroxbury.csv')

housing_df.columns = [s.strip().replace(' ', '_') for s in housing_df.columns]

housing_df = pd.get_dummies(housing_df, prefix_sep='_', drop_first = True)


# Create list of predictors and outcome

excludeColumns = ('TOTAL_VALUE', 'TAX')

predictors = [s for s in housing_df.columns if s not in excludeColumns]

outcome = 'TOTAL_VALUE'


# partition data

x = housing_df[predictors]

y = housing_df[outcome]

train_x, valid_x, train_y, valid_y = train_test_split(x, y, test_size = 0.4, random_state = 1)

model = LinearRegression()

model.fit(train_x, train_y)

train_pred = model.predict(train_x)

train_results = pd.DataFrame ({'TOTAL_VALUE' : train_y, 'predicted': train_pred, 'residual': train_y - train_pred})

train_results.head()

      TOTAL_VALUE   predicted   residual
2024        392.0  387.726258   4.273742
5140        476.3  430.785540  45.514460
5259        367.4  384.042952 -16.642952
421         350.3  369.005551 -18.705551
1401        348.1  314.725722  33.374278

# Predictions for a sample fo validation data

In [33]:
valid_pred = model.predict(valid_x)

valid_results = pd.DataFrame({'TOTAL_VALUE': valid_y, 'predicted': valid_pred, 'residual': valid_y-valid_pred})
valid_results.head()

      TOTAL_VALUE   predicted   residual
1822        462.0  406.946377  55.053623
1998        370.4  362.888928   7.511072
5126        407.4  390.287208  17.112792
808         316.1  382.470203 -66.370203
4034        393.2  434.334998 -41.134998

In [34]:
valid_pred

array([406.94637657, 362.88892824, 390.28720838, ..., 340.2816666 ,
       342.29171994, 365.01030078])

In [38]:
valid_y

1822    462.0
1998    370.4
5126    407.4
808     316.1
4034    393.2
        ...
3331    384.8
1821    394.9
1100    346.2
3147    341.8
3167    374.3
Name: TOTAL_VALUE, Length: 2321, dtype: float64

# Code for computing model evaluation metrics

In [35]:
pip install dmba

Collecting dmba
  Using cached dmba-0.1.0-py3-none-any.whl (11.8 MB)
Installing collected packages: dmba
Successfully installed dmba-0.1.0
Note: you may need to restart the kernel to use updated packages.

In [36]:
# import the utility function regressionSummary

from dmba import regressionSummary

#training set

regressionSummary(train_results.TOTAL_VALUE, train_results.predicted)

#Validation set

regressionSummary(valid_results.TOTAL_VALUE, valid_results.predicted)

no display found. Using non-interactive Agg backend

Regression statistics

                      Mean Error (ME) : 0.0000
       Root Mean Squared Error (RMSE) : 43.0306
            Mean Absolute Error (MAE) : 32.6042
          Mean Percentage Error (MPE) : -1.1116
Mean Absolute Percentage Error (MAPE) : 8.4886

Regression statistics

                      Mean Error (ME) : -0.1463
       Root Mean Squared Error (RMSE) : 42.7292
            Mean Absolute Error (MAE) : 31.9663
          Mean Percentage Error (MPE) : -1.0884
Mean Absolute Percentage Error (MAPE) : 8.3283

# Input new Data

In [37]:
new_data = pd.DataFrame({'LOT_SQFT':[4200, 6444, 5035], 'YR_BUILT':[1960, 1940, 1925],
                         'GROSS_AREA':[2670, 2886, 3264],'LIVING_AREA':[1710, 1474, 1523],
                         'FLOORS':[2.0, 1.5, 1.9], 'ROOMS': [10, 6, 0],
                         'BEDROOMS': [4,3,2], 'FULL_BATH': [1, 1, 1],
                         'HALF_BATH': [1, 1, 0], 'KITCHEN': [1, 1, 1],
                         'FIREPLACE': [1, 1, 0], 'REMODEL_Old':[0, 0, 0], 'REMODEL_Recent': [0,0,1]})

print(new_data)

Prediction = model.predict(new_data)

print('Prediction:', Prediction)

   LOT_SQFT  YR_BUILT  GROSS_AREA  LIVING_AREA  FLOORS  ROOMS  BEDROOMS  \
0      4200      1960        2670         1710     2.0     10         4
1      6444      1940        2886         1474     1.5      6         3
2      5035      1925        3264         1523     1.9      0         2

   FULL_BATH  HALF_BATH  KITCHEN  FIREPLACE  REMODEL_Old  REMODEL_Recent
0          1          1        1          1            0               0
1          1          1        1          1            0               0
2          1          0        1          0            0               1
Prediction: [384.47210285 378.06696706 379.03107745]